Numero de arboles en mal estado comparando parque y calle:

PREFIX tree: <http://example.org/tree>
SELECT 
	?type (COUNT(?tree) AS ?numTreesPoorCondition)
	?type (COUNT(?tree) AS ?numTreesPoorCondition)
WHERE {
	?tree tree:condition "Poor" ;
			  tree:type ?type .
}
GROUP BY ?type

Resultado:
  type     		numTreesPoorCondition
1 ParkTree		"2624"^^<http://www.w3.org/2001/XMLSchema#integer>
2 StreetTree	"783"^^<http://www.w3.org/2001/XMLSchema#integer>

numero de arboles de cada especie wikidata
PREFIX tree: <http://example.org/tree>
PREFIX wd: <http://www.wikidata.org/entity/>
PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>

SELECT ?speciesType ?label (COUNT(?tree) AS ?numTrees)
WHERE {
  ?tree wd:P31 ?speciesType .
  SERVICE <https://query.wikidata.org/sparql> {
    ?speciesType rdfs:label ?label .
    FILTER(LANG(?label) = "en")
  }
}
GROUP BY ?speciesType ?label


media de altura y ancho y extension por especie (dbpedia) de arbol:

PREFIX tree: <http://example.org/tree>
PREFIX dbr: <http://dbpedia.org/resource/> 

SELECT ?species (AVG(?diameter) AS ?avgDiameter) (AVG(?height) AS ?avgHeight) (AVG(?spreadRadius) AS ?avgSpreadRadius) WHERE {
  ?tree a ?species ;
        tree:diameter ?diameter ;
        tree:treeHeight ?height ;
        tree:spreadRadius ?spreadRadius .
        
} GROUP BY ?species

"species","avgDiameter","avgHeight","avgSpreadRadius"
"http://dbpedia.org/resource/Betula_pendula","0.26960793","12.436275","3.3088236"
"http://dbpedia.org/resource/Araucaria_araucana","0.35999998","11.666667","4.3333335"
"http://dbpedia.org/resource/Robinia_pseudoacacia","0.44","12.8","5.2"
"http://dbpedia.org/resource/Betula_ermanii","0.174","9.4","2.7"

que especie es mas comun en las calles 
PREFIX tree: <http://example.org/tree>
PREFIX wd: <http://www.wikidata.org/entity/>

SELECT ?species (COUNT(?streetTree) AS ?count)
WHERE {
  ?streetTree tree:type "StreetTree" ;
              wd:P31 ?species .
}
GROUP BY ?species
ORDER BY DESC(?count)
LIMIT 1

wikidata: sacar fotos para cada arbol

Árbol más alto de todos con su especie y ubicación

PREFIX wd: <http://www.wikidata.org/entity/>
PREFIX tree: <http://example.org/tree>
PREFIX geo1: <http://www.w3.org/2003/01/geo/wgs84_pos#> 

SELECT ?tree ?speciesType ?species ?treeHeight ?longitude ?latitude
WHERE {
  ?tree tree:treeHeight ?treeHeight ;
        geo1:long ?longitude ;
        geo1:lat ?latitude .
  OPTIONAL {?tree wd:P31 ?speciesType}
  OPTIONAL {?tree a ?species }
        
  {
    SELECT (MAX(?height) AS ?maxHeight)
    WHERE {
      ?t tree:treeHeight ?height .
    }
  }
  FILTER(?treeHeight = ?maxHeight)
}

SELECT ?species (AVG(?diameter) AS ?avgDiameter) (AVG(?height) AS ?avgHeight) (AVG(?spreadRadius) AS ?avgSpreadRadius) WHERE {
  ?tree wd:P31 ?species ;
        tree:diameter ?diameter ;
        tree:treeHeight ?height ;
        tree:spreadRadius ?spreadRadius .
        
} GROUP BY ?species


PREFIX tree: <http://example.org/tree>
PREFIX wd: <http://www.wikidata.org/entity/>

SELECT 
	?speciesType (COUNT(?tree) AS ?numTrees)
WHERE {
	?tree wd:P31 ?speciesType.
}
GROUP BY ?speciesType